# 38. Напишите программу, удаляющую из текста все слова, содержащие "абв".
#
# 39. Сщздайте программу для игры с конфетами человек против человека.
#   Условие задачи: На столе лежит 2021 конфета. Играют два игрока, делая ход друг после друга.
#   Первый ход определяется жеребьевкой. За один ход можно забрать не более чем 28 конфет.
#   Все конфеты оппонента достаются сделавшему последний ход. Сколько конфет нужно взять первому игроку,
#   чтобы забрать все конфеты у своего конкурента?
#       а) добавьте игру против бота
#       б) подумайте как наделить бота "интеллектом"
#
# 40. Создайте программу для игры в "Крестики-нолики".
#
# 42. Реализуйте RLE алгоритм: реализуйте модуль сжатия и восстановления данных.
# Входные и выходные данные хранятся в отдельных текстовых файлах.
